FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_GPIO.c
/*-------------------------------------------------------------------------*
 * File:  GPIO.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC2478 GPIO Interface.
 * Implementation:
 *      A single GPIO0 is created, but the code can be easily changed for
 *      other processors to use multiple GPIO busses.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2010 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <Config.h>
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <HAL/Interrupt.h>
#include <Source/Processor/NXP/LPC2478/LPC2478_GPIO.h>
#include <uEZPlatform.h>
#include <uEZGPIO.h>

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    TVUInt32 *iPINSELReg1;
    TVUInt32 *iPINSELReg2;
    TVUInt32 *iPINMODEReg1;
    TVUInt32 *iPINMODEReg2;
    TVUInt32 *iIOPIN;
    TVUInt32 *iIOSET;
    TVUInt32 *iIOCLR;
    TVUInt32 *iIODIR;
    TVUInt32 *iIOIntEnR;
    TVUInt32 *iIOIntEnF;
    TVUInt32 *iIOIntStatR;
    TVUInt32 *iIOIntStatF;
    TVUInt32 *iIOIntClr;
} LPC2478_GPIO_PortInfo;

typedef struct {
    const HAL_GPIOPort *iHAL;
    const LPC2478_GPIO_PortInfo *iPortInfo;
    T_gpioInterruptHandler iInterruptCallback;
    void *iInterruptCallbackWorkspace;
    TUInt32 iLocked;
} T_LPC2478_GPIO_Workspace;

const LPC2478_GPIO_PortInfo GPIO_LPC2478_Port0_PortInfo = {
    (TVUInt32 *)0xE002C000, // PINSEL0
    (TVUInt32 *)0xE002C004, //&PINSEL1,
    (TVUInt32 *)0xE002C040, // &PINMODE0,
    (TVUInt32 *)0xE002C044, // &PINMODE1,
    (TVUInt32 *)0xE0028000, // &IO0PIN,
    (TVUInt32 *)0xE0028004, // &IO0SET,
    (TVUInt32 *)0xE002800C, // &IO0CLR,
    (TVUInt32 *)0xE0028008, //&IO0DIR,
    (TVUInt32 *)0xE0028090, //&IO0IntEnR,
    (TVUInt32 *)0xE0028094, //&IO0IntEnF,
    (TVUInt32 *)0xE0028084, //&IO0IntStatR,
    (TVUInt32 *)0xE0028088, //&IO0IntStatF,
    (TVUInt32 *)0xE002808C, //&IO0IntClr,
};

const LPC2478_GPIO_PortInfo GPIO_LPC2478_Port1_PortInfo = {
    (TVUInt32 *)0xE002C008, //&PINSEL2,
    (TVUInt32 *)0xE002C00C, //&PINSEL3,
    (TVUInt32 *)0xE002C048, //&PINMODE2,
    (TVUInt32 *)0xE002C04C, //&PINMODE3,
    (TVUInt32 *)0xE0028010, //&IO1PIN,
    (TVUInt32 *)0xE0028014, //&IO1SET,
    (TVUInt32 *)0xE002801C, //&IO1CLR,
    (TVUInt32 *)0xE0028018, //&IO1DIR,
    0,
    0,
    0,
    0,
    0
};

const LPC2478_GPIO_PortInfo GPIO_LPC2478_Port2_PortInfo = {
    (TVUInt32 *)0xE002C010, //&PINSEL4,
    (TVUInt32 *)0xE002C014, //&PINSEL5,
    (TVUInt32 *)0xE002C050, //&PINMODE4,
    (TVUInt32 *)0xE002C050, //&PINMODE5,
    (TVUInt32 *)0x3FFFC054, //&FIO2PIN,
    (TVUInt32 *)0x3FFFC058, //&FIO2SET,
    (TVUInt32 *)0x3FFFC05C, //&FIO2CLR,
    (TVUInt32 *)0x3FFFC040, //&FIO2DIR,
    (TVUInt32 *)0xE00280B0, //&IO2IntEnR,
    (TVUInt32 *)0xE00280B4, //&IO2IntEnF,
    (TVUInt32 *)0xE00280A4, //&IO2IntStatR,
    (TVUInt32 *)0xE00280A8, //&IO2IntStatF,
    (TVUInt32 *)0xE00280AC, //&IO2IntClr,
};

const LPC2478_GPIO_PortInfo GPIO_LPC2478_Port3_PortInfo = {
    (TVUInt32 *)0xE002C018, //&PINSEL6,
    (TVUInt32 *)0xE002C01C, //&PINSEL7,
    (TVUInt32 *)0xE002C058, //&PINMODE6,
    (TVUInt32 *)0xE002C05C, //&PINMODE7,
    (TVUInt32 *)0x3FFFC074, //&FIO3PIN,
    (TVUInt32 *)0x3FFFC078, //&FIO3SET,
    (TVUInt32 *)0x3FFFC07C, //&FIO3CLR,
    (TVUInt32 *)0x3FFFC060, //&FIO3DIR,
    0,
    0,
    0,
    0,
    0
};

const LPC2478_GPIO_PortInfo GPIO_LPC2478_Port4_PortInfo = {
    (TVUInt32 *)0xE002C020, //&PINSEL8,
    (TVUInt32 *)0xE002C024, //&PINSEL9,
    (TVUInt32 *)0xE002C060, //&PINMODE8,
    (TVUInt32 *)0xE002C064, //&PINMODE9,
    (TVUInt32 *)0x3FFFC094, //&FIO4PIN,
    (TVUInt32 *)0x3FFFC098, //&FIO4SET,
    (TVUInt32 *)0x3FFFC09C, //&FIO4CLR,
    (TVUInt32 *)0x3FFFC080, //&FIO4DIR,
    0,
    0,
    0,
    0,
    0
};

static T_LPC2478_GPIO_Workspace *G_LPC2478Port0Workspace=0;
static T_LPC2478_GPIO_Workspace *G_LPC2478Port2Workspace=0;

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_Port0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC2478 GPIO Port0 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_Port0_InitializeWorkspace(void *aWorkspace)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC2478_Port0_PortInfo;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;
    G_LPC2478Port0Workspace = p;
    p->iLocked = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_Port1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC2478 GPIO Port1 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_Port1_InitializeWorkspace(void *aWorkspace)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC2478_Port1_PortInfo;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;
    p->iLocked = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_Port2_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC2478 GPIO Port2 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_Port2_InitializeWorkspace(void *aWorkspace)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC2478_Port2_PortInfo;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;
    G_LPC2478Port2Workspace = p;
    p->iLocked = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_Port3_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC2478 GPIO Port3 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_Port3_InitializeWorkspace(void *aWorkspace)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC2478_Port3_PortInfo;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;
    p->iLocked = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_Port4_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC2478 GPIO Port4 workspace.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_Port4_InitializeWorkspace(void *aWorkspace)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    p->iPortInfo = &GPIO_LPC2478_Port4_PortInfo;
    p->iInterruptCallback = 0;
    p->iInterruptCallbackWorkspace = 0;
    p->iLocked = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_SetOutputMode
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output mode.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output mode
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_SetOutputMode(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    const LPC2478_GPIO_PortInfo *p_info = p->iPortInfo;

