FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_GPIO.c
    // Output mode is set by putting 1's in the IODIR register
    (*p_info->iIODIR) |= aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_SetInputMode
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be input mode.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be input mode
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_SetInputMode(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    const LPC2478_GPIO_PortInfo *p_info = p->iPortInfo;

    // Input mode is set by putting 0's in the IODIR register
    // Make those bits 0
    (*p_info->iIODIR) &= ~aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_Set
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output HIGH.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output HIGH
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_Set(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    const LPC2478_GPIO_PortInfo *p_info = p->iPortInfo;

    // Set the bits corresponding to those pins
    (*p_info->iIOSET) = aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_Clear
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output LOW.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output HIGH
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_Clear(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    const LPC2478_GPIO_PortInfo *p_info = p->iPortInfo;

    // Set the bits corresponding to those pins
    (*p_info->iIOCLR) = aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_Read
 *---------------------------------------------------------------------------*
 * Description:
 *      Read a group of GPIO pins.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output HIGH
 *      TUInt32 *aPinsRead          -- Pointer to pins result.
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_Read(
            void *aWorkspace,
            TUInt32 aPortPins,
            TUInt32 *aPinsRead)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    const LPC2478_GPIO_PortInfo *p_info = p->iPortInfo;

    // Get the bits
    *aPinsRead = ((*p_info->iIOPIN) & aPortPins);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_SetPull
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output mode.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt8 aPortPinIndex        -- Index to pin 0-31
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_SetPull(
            void *aWorkspace,
            TUInt8 aPortPinIndex,
            T_gpioPull aPull)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    const LPC2478_GPIO_PortInfo *p_info = p->iPortInfo;

    // Control the pull up/down/none register for this pin
    if (aPortPinIndex < 16) {
        aPortPinIndex <<= 1;
        *p_info->iPINMODEReg1 =
            (*p_info->iPINMODEReg1 &
                (~(3<<aPortPinIndex))) |
                (aPull << aPortPinIndex);
    } else {
        aPortPinIndex -= 16;
        aPortPinIndex <<= 1;
        *p_info->iPINMODEReg2 =
            (*p_info->iPINMODEReg2 &
                (~(3<<aPortPinIndex))) |
                (aPull << aPortPinIndex);
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_SetMux
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pin's mux feature.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt8 aPortPinIndex        -- Index to pin 0-31
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_SetMux(
            void *aWorkspace,
            TUInt8 aPortPinIndex,
            T_gpioMux aMux)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    const LPC2478_GPIO_PortInfo *p_info = p->iPortInfo;
    TUInt32 shift;

    if (aPortPinIndex >= 32)
        return UEZ_ERROR_INVALID_PARAMETER;
    if (aMux >= 4)
        return UEZ_ERROR_OUT_OF_RANGE;

    // Setup the pin connect block (pins 0-31)
    if (aPortPinIndex < 16) {
        // Pins 0-15
        shift = (aPortPinIndex<<1);
        (*p_info->iPINSELReg1) &= ~(3 << shift);
        (*p_info->iPINSELReg1) |= aMux << shift;
    } else {
        // Pins 16-31
        shift = ((aPortPinIndex-16)<<1);
        (*p_info->iPINSELReg2) &= ~(3 << shift);
        (*p_info->iPINSELReg2) |= aMux << shift;
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_SetInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the GPIO's interrupt mode (enable if not already enabled)
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      T_gpioInterruptHandler iInterruptCallback -- Routine to call on
 *                                      interrupt.
 *      void *iInterruptCallbackWorkspace -- Workspace of callback
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_ConfigureInterruptCallback(
        void *aWorkspace,
        T_gpioInterruptHandler aInterruptCallback,
        void *aInterruptCallbackWorkspace)
{
    extern void LPC2478_InterruptEnsureSharedEXT3Registered(void);
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;

    // Register the interrupt handler if not already registered
    LPC2478_InterruptEnsureSharedEXT3Registered();
    p->iInterruptCallback = aInterruptCallback;
    p->iInterruptCallbackWorkspace = aInterruptCallbackWorkspace;
    return UEZ_ERROR_NONE;
}

T_uezError LPC2478_GPIO_ConfigureInterruptCallback_NotSupported(
        void *aWorkspace,
        T_gpioInterruptHandler aInterruptCallback,
        void *aInterruptCallbackWorkspace)
{
    PARAM_NOT_USED(aWorkspace);
    PARAM_NOT_USED(aInterruptCallback);
    PARAM_NOT_USED(aInterruptCallbackWorkspace);

    // No IRQs on these
    return UEZ_ERROR_NOT_SUPPORTED;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_ProcessIRQ
 *---------------------------------------------------------------------------*
 * Description:
 *      One of the GPIO ports is reporting an IRQ.  This processes one
 *      of the ports for falling or rising edge events.
 * NOTES:
 *      This routine is inside an interrupt!
 *---------------------------------------------------------------------------*/
void LPC2478_GPIO_ProcessIRQ(T_LPC2478_GPIO_Workspace *p)
{
    TUInt32 regF;
    TUInt32 regR;
    const LPC2478_GPIO_PortInfo *p_info = p->iPortInfo;

