FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_GPIO.c
    // Make sure we have a handler
    if (!p->iInterruptCallback)
        InterruptFatalError();

    // Do we have any falling edge interrupts?
    regF = *(p_info->iIOIntStatF);
    regR = *(p_info->iIOIntStatR);
    if (regF)
        p->iInterruptCallback(
                p->iInterruptCallbackWorkspace,
                regF,
                GPIO_INTERRUPT_FALLING_EDGE);

    // Do we have any rising edge interrupts?
    if (regR)
        p->iInterruptCallback(
                p->iInterruptCallbackWorkspace,
                regR,
                GPIO_INTERRUPT_RISING_EDGE);

    // Now clear all the interrupts processed above
    // (regardless of enabled/disabled state)
    *(p_info->iIOIntClr) = regF|regR;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_ISR
 *---------------------------------------------------------------------------*
 * Description:
 *      One of the GPIO interrupts have fired off, do the right one.
 * NOTES:
 *      This routine is inside an interrupt!
 *---------------------------------------------------------------------------*/
void LPC2478_GPIO_ISR(void)
{
    // It's port 0 and/or port 2, is this port 0 firing?
    if (IOIntStatus & IOIntStatus_P0Int)
        LPC2478_GPIO_ProcessIRQ(G_LPC2478Port0Workspace);
    if (IOIntStatus & IOIntStatus_P2Int)
        LPC2478_GPIO_ProcessIRQ(G_LPC2478Port2Workspace);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_EnableInterrupts
 *---------------------------------------------------------------------------*
 * Description:
 *      Turn on the interrupts for the given type of one or more port pins.
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Masked list of ports to enable.
 *      T_gpioInterruptType aType   -- Type of interrupts to enable.
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_EnableInterrupts(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    const LPC2478_GPIO_PortInfo *p_info = p->iPortInfo;

    if (aType == GPIO_INTERRUPT_FALLING_EDGE)
        (*p_info->iIOIntEnF) |= aPortPins;
    else if (aType == GPIO_INTERRUPT_RISING_EDGE)
        (*p_info->iIOIntEnR) |= aPortPins;
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_DisableInterrupts
 *---------------------------------------------------------------------------*
 * Description:
 *      Turn off the interrupts for the given type of one or more port pins.
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Masked list of ports to disable.
 *      T_gpioInterruptType aType   -- Type of interrupts to disable.
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_DisableInterrupts(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    const LPC2478_GPIO_PortInfo *p_info = p->iPortInfo;

    if (aType == GPIO_INTERRUPT_FALLING_EDGE)
        (*p_info->iIOIntEnF) &= ~aPortPins;
    else if (aType == GPIO_INTERRUPT_RISING_EDGE)
        (*p_info->iIOIntEnR) &= ~aPortPins;
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_ClearInterrupts
 *---------------------------------------------------------------------------*
 * Description:
 *      Clear interrupts on a specific GPIO line
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Masked list of ports to disable.
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_ClearInterrupts(
        void *aWorkspace,
        TUInt32 aPortPins)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    const LPC2478_GPIO_PortInfo *p_info = p->iPortInfo;

	(*p_info->iIOIntClr) = aPortPins;
    return UEZ_ERROR_NONE;
}

T_uezError LPC2478_GPIO_EnableInterrupts_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
	PARAM_NOT_USED(aWorkspace);
	PARAM_NOT_USED(aPortPins);
	PARAM_NOT_USED(aType);
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError LPC2478_GPIO_DisableInterrupts_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
	PARAM_NOT_USED(aWorkspace);
	PARAM_NOT_USED(aPortPins);
	PARAM_NOT_USED(aType);
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError LPC2478_GPIO_ClearInterrupts_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins)
{
	PARAM_NOT_USED(aWorkspace);
	PARAM_NOT_USED(aPortPins);
        return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError LPC2478_GPIO_Control(
        void *aWorkspace,
        TUInt8 aPortPinIndex,
        T_gpioControl aControl,
        TUInt32 aValue)
{
    //T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;

    PARAM_NOT_USED(aValue);

    switch (aControl) {
        case GPIO_NOP:
            // Yep, do no operation
            break;
        default:
            return UEZ_ERROR_NOT_SUPPORTED;
#if (COMPILER_TYPE != IAR)
            break;
#endif
    }

    return UEZ_ERROR_NONE;
}

T_uezError LPC2478_GPIO_Lock(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    // Any pins already locked?
    if (p->iLocked & aPortPins) {
        UEZFailureMsg("PinLock");
        return UEZ_ERROR_NOT_AVAILABLE;
    }
    p->iLocked |= aPortPins;
    return UEZ_ERROR_NONE;
}

T_uezError LPC2478_GPIO_Unlock(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;

    p->iLocked &= ~aPortPins;
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_GPIO_GetMux
 *---------------------------------------------------------------------------*
 * Description:
 *      Get pin's mux feature.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt8 aPortPinIndex        -- Index to pin 0-31
 *      T_gpioMux aMux              -- Mux setting being used
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_GPIO_GetMux(
        void *aWorkspace,
        TUInt8 aPortPinIndex,
        T_gpioMux *aMux)
{
    T_LPC2478_GPIO_Workspace *p = (T_LPC2478_GPIO_Workspace *)aWorkspace;
    const LPC2478_GPIO_PortInfo *p_info = p->iPortInfo;
    TUInt32 shift;

