FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_GPIO.c
    if (aPortPinIndex >= 32)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Decode the pin connect block (pins 0-31) into 2 bit pairs
    if (aPortPinIndex < 16) {
        // Pins 0-15
        shift = (aPortPinIndex<<1);
        *aMux = ((*p_info->iPINSELReg1) >> shift) & 3;
    } else {
        // Pins 16-31
        shift = ((aPortPinIndex-16)<<1);
        *aMux = ((*p_info->iPINSELReg2) >> shift) & 3;
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC2478_GPIO0_Require(void)
{
    HAL_GPIOPort **p_gpio0;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO0",
            (T_halInterface *)&GPIO_LPC2478_Port0_Interface, 0,
            (T_halWorkspace **)&p_gpio0);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_0, p_gpio0);
}

void LPC2478_GPIO1_Require(void)
{
    HAL_GPIOPort **p_gpio1;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO1 and allow all pins
    HALInterfaceRegister("GPIO1",
            (T_halInterface *)&GPIO_LPC2478_Port1_Interface, 0,
            (T_halWorkspace **)&p_gpio1);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_1, p_gpio1);
}

void LPC2478_GPIO2_Require(void)
{
    HAL_GPIOPort **p_gpio2;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO2 and allow all pins
    HALInterfaceRegister("GPIO2",
            (T_halInterface *)&GPIO_LPC2478_Port2_Interface, 0,
            (T_halWorkspace **)&p_gpio2);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_2, p_gpio2);
}

void LPC2478_GPIO3_Require(void)
{
    HAL_GPIOPort **p_gpio3;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO3 and allow all pins
    HALInterfaceRegister("GPIO3",
            (T_halInterface *)&GPIO_LPC2478_Port3_Interface, 0,
            (T_halWorkspace **)&p_gpio3);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_3, p_gpio3);
}

void LPC2478_GPIO4_Require(void)
{
    HAL_GPIOPort **p_gpio4;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO4 and allow all pins
    HALInterfaceRegister("GPIO4",
            (T_halInterface *)&GPIO_LPC2478_Port4_Interface, 0,
            (T_halWorkspace **)&p_gpio4);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_4, p_gpio4);
}

/*---------------------------------------------------------------------------*
 * HAL Interface tables:
 *---------------------------------------------------------------------------*/
const HAL_GPIOPort GPIO_LPC2478_Port0_Interface = {
    "LPC2478 GPIO Port 0",
    0x0105,
    LPC2478_GPIO_Port0_InitializeWorkspace,
    sizeof(T_LPC2478_GPIO_Workspace),

    0,
    0,
    0,
    LPC2478_GPIO_SetOutputMode,
    LPC2478_GPIO_SetInputMode,
    LPC2478_GPIO_Set,
    LPC2478_GPIO_Clear,
    LPC2478_GPIO_Read,
    LPC2478_GPIO_SetPull,
    LPC2478_GPIO_SetMux,
    LPC2478_GPIO_ConfigureInterruptCallback,
    LPC2478_GPIO_EnableInterrupts,
    LPC2478_GPIO_DisableInterrupts,
    LPC2478_GPIO_ClearInterrupts,
    LPC2478_GPIO_Control,
    LPC2478_GPIO_Lock,
    LPC2478_GPIO_Unlock,
    /* uEZ v2.04 */
    LPC2478_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC2478_Port1_Interface = {
    "LPC2478 GPIO Port 1",
    0x0105,
    LPC2478_GPIO_Port1_InitializeWorkspace,
    sizeof(T_LPC2478_GPIO_Workspace),

    0,
    0,
    0,
    LPC2478_GPIO_SetOutputMode,
    LPC2478_GPIO_SetInputMode,
    LPC2478_GPIO_Set,
    LPC2478_GPIO_Clear,
    LPC2478_GPIO_Read,
    LPC2478_GPIO_SetPull,
    LPC2478_GPIO_SetMux,
    LPC2478_GPIO_ConfigureInterruptCallback_NotSupported,
    LPC2478_GPIO_EnableInterrupts_NotSupported,
    LPC2478_GPIO_DisableInterrupts_NotSupported,
    LPC2478_GPIO_ClearInterrupts_NotSupported,
    LPC2478_GPIO_Control,
    LPC2478_GPIO_Lock,
    LPC2478_GPIO_Unlock,
    /* uEZ v2.04 */
    LPC2478_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC2478_Port2_Interface = {
    "LPC2478 GPIO Port 2",
    0x0105,
    LPC2478_GPIO_Port2_InitializeWorkspace,
    sizeof(T_LPC2478_GPIO_Workspace),

    0,
    0,
    0,
    LPC2478_GPIO_SetOutputMode,
    LPC2478_GPIO_SetInputMode,
    LPC2478_GPIO_Set,
    LPC2478_GPIO_Clear,
    LPC2478_GPIO_Read,
    LPC2478_GPIO_SetPull,
    LPC2478_GPIO_SetMux,
    LPC2478_GPIO_ConfigureInterruptCallback,
    LPC2478_GPIO_EnableInterrupts,
    LPC2478_GPIO_DisableInterrupts,
    LPC2478_GPIO_ClearInterrupts,
    LPC2478_GPIO_Control,
    LPC2478_GPIO_Lock,
    LPC2478_GPIO_Unlock,
    /* uEZ v2.04 */
    LPC2478_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC2478_Port3_Interface = {
    "LPC2478 GPIO Port 3",
    0x0105,
    LPC2478_GPIO_Port3_InitializeWorkspace,
    sizeof(T_LPC2478_GPIO_Workspace),

    0,
    0,
    0,
    LPC2478_GPIO_SetOutputMode,
    LPC2478_GPIO_SetInputMode,
    LPC2478_GPIO_Set,
    LPC2478_GPIO_Clear,
    LPC2478_GPIO_Read,
    LPC2478_GPIO_SetPull,
    LPC2478_GPIO_SetMux,
    LPC2478_GPIO_ConfigureInterruptCallback_NotSupported,
    LPC2478_GPIO_EnableInterrupts_NotSupported,
    LPC2478_GPIO_DisableInterrupts_NotSupported,
    LPC2478_GPIO_ClearInterrupts_NotSupported,
    LPC2478_GPIO_Control,
    LPC2478_GPIO_Lock,
    LPC2478_GPIO_Unlock,
    /* uEZ v2.04 */
    LPC2478_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC2478_Port4_Interface = {
    "LPC2478 GPIO Port 4",
    0x0105,
    LPC2478_GPIO_Port4_InitializeWorkspace,
    sizeof(T_LPC2478_GPIO_Workspace),

    0,
    0,
    0,
    LPC2478_GPIO_SetOutputMode,
    LPC2478_GPIO_SetInputMode,
    LPC2478_GPIO_Set,
    LPC2478_GPIO_Clear,
    LPC2478_GPIO_Read,
    LPC2478_GPIO_SetPull,
    LPC2478_GPIO_SetMux,
    LPC2478_GPIO_ConfigureInterruptCallback_NotSupported,
    LPC2478_GPIO_EnableInterrupts_NotSupported,
    LPC2478_GPIO_DisableInterrupts_NotSupported,
    LPC2478_GPIO_ClearInterrupts_NotSupported,
    LPC2478_GPIO_Control,
    LPC2478_GPIO_Lock,
    LPC2478_GPIO_Unlock,
    /* uEZ v2.04 */
    LPC2478_GPIO_GetMux };

/*-------------------------------------------------------------------------*
 * End of File:  GPIO.c
 *-------------------------------------------------------------------------*/
